tap "homebrew/bundle"
tap "homebrew/services"
tap "microsoft/git"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Control Google Chrome from the command-line
brew "chrome-cli"
# Modern replacement for 'ls'
brew "exa"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Pager program similar to more
brew "less"
# Mac App Store command-line interface
brew "mas"
# Node version management
brew "n"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Application launcher and productivity software
cask "alfred"
cask "git-credential-manager-core"
# Git client focusing on productivity
cask "gitkraken"
mas "Affinity Photo", id: 824183456
mas "Copy 'Em", id: 876540291
mas "Disk Map", id: 715464874
mas "Elmedia Video Player", id: 1044549675
mas "Evernote", id: 406056744
mas "File Viewer", id: 495987613
mas "Final Cut Pro", id: 424389933
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle Classic", id: 405399194
mas "Magnet", id: 441258766
mas "Name Mangler", id: 603637384
mas "Notability", id: 360593530
mas "Notion Web Clipper", id: 1559269364
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "RoboForm", id: 1464513335
mas "Slack", id: 803453959
mas "Structured", id: 1499198946
mas "WiFi Explorer", id: 494803304
mas "Xcode", id: 497799835
vscode "aaravb.chrome-extension-developer-tools"
vscode "beauallison.brew-services"
vscode "christian-kohler.npm-intellisense"
vscode "Compilenix.vscode-zonefile"
vscode "DavidAnson.vscode-markdownlint"
vscode "donjayamanne.githistory"
vscode "DotJoshJohnson.xml"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "eriklynd.json-tools"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.live-server"
vscode "mtxr.sqltools"
vscode "NicScott.gitkraken-dark"
vscode "PKief.material-icon-theme"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "xabikos.JavaScriptSnippets"
vscode "yzhang.markdown-all-in-one"
vscode "zh9528.file-size"
