tap "homebrew/bundle"
tap "homebrew/services"
tap "microsoft/git"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Control Google Chrome from the command-line
brew "chrome-cli"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Application launcher and productivity software
cask "alfred"
cask "git-credential-manager-core"
# Git client focusing on productivity
cask "gitkraken"
vscode "aaravb.chrome-extension-developer-tools"
vscode "beauallison.brew-services"
vscode "christian-kohler.npm-intellisense"
vscode "Compilenix.vscode-zonefile"
vscode "DavidAnson.vscode-markdownlint"
vscode "donjayamanne.githistory"
vscode "DotJoshJohnson.xml"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "eriklynd.json-tools"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.live-server"
vscode "mtxr.sqltools"
vscode "PKief.material-icon-theme"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "xabikos.JavaScriptSnippets"
vscode "yzhang.markdown-all-in-one"
vscode "zh9528.file-size"
